/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Valor inválido.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "O valor “%@” é inválido.";

/* NSFormattingError */
"Err2048-C" = "Erro de formatação.";

/* NSFileLockingError */
"Err255-C" = "O arquivo não pôde ser bloqueado.";

/* NSFileLockingError */
"Err255-R" = "O arquivo pode já estar bloqueado ou talvez você não tenha os privilégios de acesso apropriados para bloqueá-lo.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "O arquivo “%@” não pôde ser bloqueado.";

/* NSFileReadUnknownError */
"Err256" = "O arquivo não pôde ser aberto.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "O arquivo “%@” não pôde ser aberto.";

/* NSFileReadNoPermissionError */
"Err257" = "O arquivo não pôde ser aberto porque você não possui os privilégios de acesso apropriados.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Você não possui os privilégios de acesso apropriados.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Para visualizar ou modificar os privilégios de acesso, selecione o item no Finder e escolha Arquivo > Obter Informações.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "O arquivo “%@” não pôde ser aberto porque você não possui os privilégios de acesso apropriados.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Nome de arquivo inválido.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "O item não pôde ser aberto porque o nome de arquivo “%@” é inválido.";

/* NSFileReadCorruptFileError */
"Err259" = "O arquivo não pôde ser aberto porque não está no formado correto.";

/* NSFileReadCorruptFileError */
"Err259-C" = "O arquivo não está no formado correto.";

/* NSFileReadCorruptFileError */
"Err259-R" = "O arquivo pode estar corrompido, cortado ou em um formato diferente do esperado.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "O arquivo “%@” não pôde ser aberto porque não está no formado correto.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "O arquivo não existe.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "O arquivo “%@” não existe.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "O arquivo não pôde ser aberto usando a codificação de texto especificada.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "A codificação de texto especificada não é aplicável.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "A codificação de texto %@ não é aplicável.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "O arquivo talvez tenha sido salvo usando uma codificação de texto diferente ou talvez não seja um arquivo de texto.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "O arquivo não pôde ser aberto usando a codificação de texto %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "O arquivo “%2$@” não pôde ser aberto usando a codificação de texto %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "O arquivo não pôde ser aberto porque o tipo de URL especificada não é compatível.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "O tipo de URL especificado não é compatível.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "O arquivo “%1$@” não pôde ser aberto porque o tipo de URL %2$@ não é compatível.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "O arquivo não pôde ser aberto porque o tipo de URL %@ não é compatível.";

/* NSFileReadTooLargeError */
"Err263" = "O arquivo não pôde ser aberto porque ele é muito grande.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "O arquivo é muito grande.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "O arquivo “%@” não pôde ser aberto porque ele é muito grande.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "O arquivo não pôde ser aberto porque a codificação de texto do conteúdo não pôde ser determinada.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "A codificação de texto do conteúdo não pôde ser determinada.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Talvez seja possível abrir o arquivo especificando uma codificação de texto explícita.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "O arquivo “%@” não pôde ser aberto porque a codificação de texto do conteúdo não pôde ser determinada.";

/* NSUserCancelledError */
"Err3072-C" = "A operação foi cancelada.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "“%@” não pôde ser removido.";

/* NSFileNoSuchFileError */
"Err4-C" = "O arquivo não existe.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "O arquivo “%@” não existe.";

/* NSFileWriteUnknownError */
"Err512" = "O arquivo não pôde ser salvo.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "“%1$@” não pôde ser copiado a “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "“%1$@” não pôde ser vinculado a “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "“%1$@” não pôde ser movido para “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "“%@” não pôde ser removido.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "O arquivo “%2$@” não pôde ser salvo na pasta “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "O arquivo “%@” não pôde ser salvo.";

/* NSFileWriteNoPermissionError */
"Err513" = "O arquivo não pôde ser salvo porque você não possui os privilégios de acesso apropriados.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "“%1$@” não pôde ser copiado porque você não possui os privilégios de acesso apropriados para “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "“%1$@” não pôde ser vinculado porque você não possui os privilégios de acesso apropriados para “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "“%1$@” não pôde ser movido porque você não possui os privilégios de acesso apropriados para “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "“%@” não pôde ser removido porque você não possui os privilégios de acesso apropriados.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Você não possui os privilégios de acesso apropriados.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Para visualizar ou modificar os privilégios de acesso, selecione o item no Finder e escolha Arquivo > Obter Informações.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Você não possui os privilégios de acesso apropriados para salvar o arquivo “%2$@” na pasta “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Você não possui os privilégios de acesso apropriados para salvar o arquivo “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "O item não pôde ser salvo porque o nome de arquivo é inválido.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "O item não pôde ser removido porque o nome de arquivo “%@” é inválido.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Nome de arquivo inválido.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "O item não pôde ser salvo porque o nome de arquivo “%@” é inválido.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "O arquivo não pôde ser salvo usando a codificação de texto especificada.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "A codificação de texto especificada não é aplicável.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "A codificação de texto %@ não é aplicável.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Se for possível, selecione outra codificação de texto.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "O arquivo não pôde ser salvo usando a codificação de texto %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "O arquivo “%2$@” não pôde ser salvo usando a codificação de texto %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "O arquivo não pôde ser salvo porque o tipo de URL especificado não é compatível.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "O tipo de URL especificado não é compatível.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "O arquivo “%1$@” não pôde ser salvo porque o tipo de URL %2$@ não é compatível.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "O arquivo não pôde ser salvo porque o tipo de URL %@ não é compatível.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "O arquivo não pôde ser salvo porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "“%1$@” não pôde ser copiado em “%2$@” porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "“%1$@” não pôde ser vinculado a “%2$@” porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "“%1$@” não pôde ser movido para “%2$@” porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "O volume “%@” está sem espaço.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Remova alguns arquivos do volume e tente novamente.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Você não pode salvar o arquivo “%@” porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Você não pode salvar o arquivo “%1$@” porque o volume “%2$@” está sem espaço.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "A operação não pôde ser completada. (%1$@ erro %2$ld.)";

